Installation of Pandas on your system requires NumPy to be installed. Details on this installation can be found in the Pandas documentation. 

Once Pandas is installed, you can import it and check the version:

In [85]:
import pandas
pandas.__version__

'1.5.3'

Just as we generally import NumPy under the alias np, we will import Pandas under the alias pd:

In [86]:
import pandas as pd
import numpy as np

Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices. Three fundamental Pandas data structures: the Series, DataFrame, and Index.

In [87]:
data = pd.Series(np.array([0.25, 0.5, 0.75, 1.0]), dtype='float')
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [88]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

As we see in the output, the Series wraps both a sequence of values and a sequence of indices, which we can access with the values and index attributes. The values are simply a familiar NumPy array:

In [89]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

The index is an array-like object of type pd.Index, which we'll discuss in more detail momentarily.

In [90]:
data.index

RangeIndex(start=0, stop=4, step=1)

Like with a NumPy array, data can be accessed by the associated index via the familiar Python square-bracket notation:

In [91]:
data[1]

0.5

In [92]:
data[1:3:]

1    0.50
2    0.75
dtype: float64

From what we've seen so far, it may look like the Series object is basically interchangeable with a one-dimensional NumPy array. The essential difference is the presence of the index: while the Numpy Array has an implicitly defined integer index used to access the values, the Pandas Series has an explicitly defined index associated with the values.

This explicit index definition gives the Series object additional capabilities. For example, the index need not be an integer, but can consist of values of any desired type. For example, if we wish, we can use strings as an index:

In [93]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [94]:
data['b']

0.5

We can even use non-contiguous or non-sequential indices:

In [95]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [96]:
data[5]

0.5

Creating a DataFrame by passing a NumPy array, with a datetime index using date_range() and labeled columns, freq default is 'D', check link https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases

In [97]:
dates = pd.date_range("20130101", periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Array of standard normal distribution of size (6, 4) https://numpy.org/doc/stable/reference/random/generated/numpy.random.randn.html

DataFrame

In [98]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates ,   columns=list("ABCD"))               
df

                   A         B         C         D
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690
2013-01-03  0.859964  0.501965  0.881909  0.783556
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825
2013-01-05 -0.610916  0.427255  1.655312  0.178892
2013-01-06  0.543140 -1.175241  0.506905  0.748069

Creating a DataFrame by passing a dictionary of objects that can be converted into a series-like structure:

In [99]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Series(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [100]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E            object
F            object
dtype: object

In [101]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [102]:
df2.tail(3)

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [103]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy() gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

For df, our DataFrame of all floating-point values, and DataFrame.to_numpy() is fast and doesnâ€™t require copying data:

In [104]:
df.to_numpy()

array([[ 0.29314157, -1.29116099, -0.23375653, -0.25927168],
       [ 1.18786633, -0.61024854, -0.40030114, -0.06568992],
       [ 0.85996413,  0.50196486,  0.88190939,  0.7835562 ],
       [-1.18571479, -1.6187331 , -0.50912356, -1.49082498],
       [-0.61091627,  0.42725536,  1.65531166,  0.17889224],
       [ 0.54313988, -1.17524133,  0.50690463,  0.74806898]])

For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() is relatively expensive:

In [105]:
df2.to_csv('C:/Users/SV488YV/OneDrive - EY/Desktop/Learning/Python/Week_4/datframe.csv')

In [106]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy() does not include the index or column labels in the output.

describe() shows a quick statistic summary of your data:

In [107]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.181247 -0.627694  0.316824 -0.017545
std    0.907032  0.906808  0.854002  0.836399
min   -1.185715 -1.618733 -0.509124 -1.490825
25%   -0.384902 -1.262181 -0.358665 -0.210876
50%    0.418141 -0.892745  0.136574  0.056601
75%    0.780758  0.167879  0.788158  0.605775
max    1.187866  0.501965  1.655312  0.783556

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [109]:
df

                   A         B         C         D
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690
2013-01-03  0.859964  0.501965  0.881909  0.783556
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825
2013-01-05 -0.610916  0.427255  1.655312  0.178892
2013-01-06  0.543140 -1.175241  0.506905  0.748069

In [110]:
for index, row in df.iterrows():
    print( index , row)

2013-01-01 00:00:00 A    0.293142
B   -1.291161
C   -0.233757
D   -0.259272
Name: 2013-01-01 00:00:00, dtype: float64
2013-01-02 00:00:00 A    1.187866
B   -0.610249
C   -0.400301
D   -0.065690
Name: 2013-01-02 00:00:00, dtype: float64
2013-01-03 00:00:00 A    0.859964
B    0.501965
C    0.881909
D    0.783556
Name: 2013-01-03 00:00:00, dtype: float64
2013-01-04 00:00:00 A   -1.185715
B   -1.618733
C   -0.509124
D   -1.490825
Name: 2013-01-04 00:00:00, dtype: float64
2013-01-05 00:00:00 A   -0.610916
B    0.427255
C    1.655312
D    0.178892
Name: 2013-01-05 00:00:00, dtype: float64
2013-01-06 00:00:00 A    0.543140
B   -1.175241
C    0.506905
D    0.748069
Name: 2013-01-06 00:00:00, dtype: float64

df.describe()

In [111]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.293142    1.187866    0.859964   -1.185715   -0.610916    0.543140
B   -1.291161   -0.610249    0.501965   -1.618733    0.427255   -1.175241
C   -0.233757   -0.400301    0.881909   -0.509124    1.655312    0.506905
D   -0.259272   -0.065690    0.783556   -1.490825    0.178892    0.748069

sorts by an axis:

In [112]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  0.543140 -1.175241  0.506905  0.748069
2013-01-05 -0.610916  0.427255  1.655312  0.178892
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825
2013-01-03  0.859964  0.501965  0.881909  0.783556
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272

In [113]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272
2013-01-06  0.543140 -1.175241  0.506905  0.748069
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690
2013-01-05 -0.610916  0.427255  1.655312  0.178892
2013-01-03  0.859964  0.501965  0.881909  0.783556

Selecting a single column, which yields a Series, equivalent to df.A:

In [114]:
df

                   A         B         C         D
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690
2013-01-03  0.859964  0.501965  0.881909  0.783556
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825
2013-01-05 -0.610916  0.427255  1.655312  0.178892
2013-01-06  0.543140 -1.175241  0.506905  0.748069

In [115]:
df["A"]

2013-01-01    0.293142
2013-01-02    1.187866
2013-01-03    0.859964
2013-01-04   -1.185715
2013-01-05   -0.610916
2013-01-06    0.543140
Freq: D, Name: A, dtype: float64

In [116]:
df[["A",'B']]

                   A         B
2013-01-01  0.293142 -1.291161
2013-01-02  1.187866 -0.610249
2013-01-03  0.859964  0.501965
2013-01-04 -1.185715 -1.618733
2013-01-05 -0.610916  0.427255
2013-01-06  0.543140 -1.175241

In [117]:
df.loc['2013-01-05']

A   -0.610916
B    0.427255
C    1.655312
D    0.178892
Name: 2013-01-05 00:00:00, dtype: float64

In [118]:
df.loc[['2013-01-05','2013-01-06']]

                   A         B         C         D
2013-01-05 -0.610916  0.427255  1.655312  0.178892
2013-01-06  0.543140 -1.175241  0.506905  0.748069

In [119]:
df.loc[['2013-01-05','2013-01-06'], 'B']

2013-01-05    0.427255
2013-01-06   -1.175241
Name: B, dtype: float64

In [120]:
df.loc[ '2013-01-04' , 'B']

-1.6187331035447419

In [121]:
df.iloc[[0]]

                   A         B         C         D
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272

In [122]:
df.iloc[:,0:2]

                   A         B
2013-01-01  0.293142 -1.291161
2013-01-02  1.187866 -0.610249
2013-01-03  0.859964  0.501965
2013-01-04 -1.185715 -1.618733
2013-01-05 -0.610916  0.427255
2013-01-06  0.543140 -1.175241

In [123]:
df.iloc[:,:-1]          #These are slicing therefore only single bracket, it will be dataframe

                   A         B         C
2013-01-01  0.293142 -1.291161 -0.233757
2013-01-02  1.187866 -0.610249 -0.400301
2013-01-03  0.859964  0.501965  0.881909
2013-01-04 -1.185715 -1.618733 -0.509124
2013-01-05 -0.610916  0.427255  1.655312
2013-01-06  0.543140 -1.175241  0.506905

In [124]:
df[0:3]

                   A         B         C         D
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690
2013-01-03  0.859964  0.501965  0.881909  0.783556

In [125]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690
2013-01-03  0.859964  0.501965  0.881909  0.783556
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825

In [126]:
df['E'] = np.random.randn(6)   # new column
df

                   A         B         C         D         E
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272 -1.567249
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690  0.942723
2013-01-03  0.859964  0.501965  0.881909  0.783556 -1.498504
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825  0.119537
2013-01-05 -0.610916  0.427255  1.655312  0.178892 -0.469846
2013-01-06  0.543140 -1.175241  0.506905  0.748069 -0.434741

In [127]:
df.loc['2013-01-04','E'] = 1
df

                   A         B         C         D         E
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272 -1.567249
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690  0.942723
2013-01-03  0.859964  0.501965  0.881909  0.783556 -1.498504
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825  1.000000
2013-01-05 -0.610916  0.427255  1.655312  0.178892 -0.469846
2013-01-06  0.543140 -1.175241  0.506905  0.748069 -0.434741

In [128]:
df['F'] = df['E']**2
df

                   A         B         C         D         E         F
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272 -1.567249  2.456268
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690  0.942723  0.888726
2013-01-03  0.859964  0.501965  0.881909  0.783556 -1.498504  2.245514
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825  1.000000  1.000000
2013-01-05 -0.610916  0.427255  1.655312  0.178892 -0.469846  0.220756
2013-01-06  0.543140 -1.175241  0.506905  0.748069 -0.434741  0.189000

In [129]:
for i in df.index:
    for j in df.columns:
        if df.loc[i,j] == 1.911782:
            print(i,j)
            break

In [130]:
df.loc[pd.Timestamp('2013-01-07')] = np.random.randn(6)  
df                                                               # new row

                   A         B         C         D         E         F
2013-01-01  0.293142 -1.291161 -0.233757 -0.259272 -1.567249  2.456268
2013-01-02  1.187866 -0.610249 -0.400301 -0.065690  0.942723  0.888726
2013-01-03  0.859964  0.501965  0.881909  0.783556 -1.498504  2.245514
2013-01-04 -1.185715 -1.618733 -0.509124 -1.490825  1.000000  1.000000
2013-01-05 -0.610916  0.427255  1.655312  0.178892 -0.469846  0.220756
2013-01-06  0.543140 -1.175241  0.506905  0.748069 -0.434741  0.189000
2013-01-07 -0.890952  1.322175  0.694070  0.501932 -0.519523 -0.644743

For getting a cross section using a label:

In [131]:
df.loc[dates[0]]

A    0.293142
B   -1.291161
C   -0.233757
D   -0.259272
E   -1.567249
F    2.456268
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [132]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.293142 -1.291161
2013-01-02  1.187866 -0.610249
2013-01-03  0.859964  0.501965
2013-01-04 -1.185715 -1.618733
2013-01-05 -0.610916  0.427255
2013-01-06  0.543140 -1.175241
2013-01-07 -0.890952  1.322175

In [133]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.899185  0.803563  1.984353  1.604849
2013-01-02 -0.340097  1.556520 -0.209207  0.161533
2013-01-03  0.936663 -0.113085  0.055640  0.494500
2013-01-04  0.684376  1.719106  1.145440 -1.792193
2013-01-05 -2.014516  0.495866  0.937052  0.554766
2013-01-06 -1.065140 -0.222969  0.010592  0.397981

Select via the position of the passed integers:

In [134]:
df.iloc[3]

A    0.684376
B    1.719106
C    1.145440
D   -1.792193
Name: 2013-01-04 00:00:00, dtype: float64

In [135]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.684376  1.719106
2013-01-05 -2.014516  0.495866

By lists of integer position locations, similar to the NumPy/Python style:

In [136]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.340097 -0.209207
2013-01-03  0.936663  0.055640
2013-01-05 -2.014516  0.937052

Boolean indexing

Using a single columnâ€™s values to select data:

In [137]:
df[df["A"] > 0]

                   A         B        C         D
2013-01-03  0.936663 -0.113085  0.05564  0.494500
2013-01-04  0.684376  1.719106  1.14544 -1.792193

In [138]:
df["A"] > 0

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: A, dtype: bool

Selecting values from a DataFrame where a boolean condition is met:

In [139]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.803563  1.984353  1.604849
2013-01-02       NaN  1.556520       NaN  0.161533
2013-01-03  0.936663       NaN  0.055640  0.494500
2013-01-04  0.684376  1.719106  1.145440       NaN
2013-01-05       NaN  0.495866  0.937052  0.554766
2013-01-06       NaN       NaN  0.010592  0.397981

Using the isin() method for filtering:

In [140]:
df2 = df.copy()

In [141]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [142]:
df2

                   A         B         C         D      E
2013-01-01 -0.899185  0.803563  1.984353  1.604849    one
2013-01-02 -0.340097  1.556520 -0.209207  0.161533    one
2013-01-03  0.936663 -0.113085  0.055640  0.494500    two
2013-01-04  0.684376  1.719106  1.145440 -1.792193  three
2013-01-05 -2.014516  0.495866  0.937052  0.554766   four
2013-01-06 -1.065140 -0.222969  0.010592  0.397981  three

In [143]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.936663 -0.113085  0.055640  0.494500   two
2013-01-05 -2.014516  0.495866  0.937052  0.554766  four

<b>Missing data</b>
<t>pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

In [144]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"] )

In [145]:
df1

                   A         B         C         D   E
2013-01-01 -0.899185  0.803563  1.984353  1.604849 NaN
2013-01-02 -0.340097  1.556520 -0.209207  0.161533 NaN
2013-01-03  0.936663 -0.113085  0.055640  0.494500 NaN
2013-01-04  0.684376  1.719106  1.145440 -1.792193 NaN

In [146]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [147]:
df1

                   A         B         C         D    E
2013-01-01 -0.899185  0.803563  1.984353  1.604849  1.0
2013-01-02 -0.340097  1.556520 -0.209207  0.161533  1.0
2013-01-03  0.936663 -0.113085  0.055640  0.494500  NaN
2013-01-04  0.684376  1.719106  1.145440 -1.792193  NaN

DataFrame.dropna() drops any rows that have missing data:

In [148]:
df1.dropna(how="any")

                   A         B         C         D    E
2013-01-01 -0.899185  0.803563  1.984353  1.604849  1.0
2013-01-02 -0.340097  1.556520 -0.209207  0.161533  1.0

In [149]:
df1.dropna(how="all")

                   A         B         C         D    E
2013-01-01 -0.899185  0.803563  1.984353  1.604849  1.0
2013-01-02 -0.340097  1.556520 -0.209207  0.161533  1.0
2013-01-03  0.936663 -0.113085  0.055640  0.494500  NaN
2013-01-04  0.684376  1.719106  1.145440 -1.792193  NaN

In [150]:
df1.describe()

              A         B         C         D    E
count  4.000000  4.000000  4.000000  4.000000  2.0
mean   0.095439  0.991526  0.744057  0.117172  1.0
std    0.862839  0.837474  1.013586  1.414591  0.0
min   -0.899185 -0.113085 -0.209207 -1.792193  1.0
25%   -0.479869  0.574401 -0.010572 -0.326899  1.0
50%    0.172140  1.180041  0.600540  0.328016  1.0
75%    0.747448  1.597166  1.355168  0.772087  1.0
max    0.936663  1.719106  1.984353  1.604849  1.0

DataFrame.fillna() fills missing data:

In [151]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -0.899185  0.803563  1.984353  1.604849  1.0
2013-01-02 -0.340097  1.556520 -0.209207  0.161533  1.0
2013-01-03  0.936663 -0.113085  0.055640  0.494500  5.0
2013-01-04  0.684376  1.719106  1.145440 -1.792193  5.0

In [152]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01 -0.899185  0.803563  1.984353  1.604849  1.0
2013-01-02 -0.340097  1.556520 -0.209207  0.161533  1.0
2013-01-03  0.936663 -0.113085  0.055640  0.494500  1.0
2013-01-04  0.684376  1.719106  1.145440 -1.792193  1.0

isna() gets the boolean mask where values are nan:

In [153]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

DataFrame.apply() applies a user defined function to the data:

In [154]:
df1.apply(np.cumsum)

                   A         B         C         D    E
2013-01-01 -0.899185  0.803563  1.984353  1.604849  1.0
2013-01-02 -1.239281  2.360083  1.775146  1.766382  2.0
2013-01-03 -0.302618  2.246998  1.830786  2.260882  NaN
2013-01-04  0.381757  3.966103  2.976226  0.468688  NaN

In [155]:
df1.apply(lambda x: x.max() - x.min())                 
#Purpose: The .apply method is used to apply a function along the axis of a DataFrame or Series.
#Usage: It is typically used to perform element-wise operations on the data in a DataFrame or Series. 
#You can use it to transform, aggregate, or perform other operations on the data.

A    1.835848
B    1.832191
C    2.193560
D    3.397043
E    0.000000
dtype: float64

In [198]:
ex_df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

def square(x):
    return x ** 2

ex_df['A_squared'] = ex_df['A'].apply(square)
ex_df

   A  B  A_squared
0  1  4          1
1  2  5          4
2  3  6          9

In [156]:
df1.assign(temp_f=lambda x: x.A * 9 / 5 + 32)
#Purpose: The .assign method is used to add new columns to a DataFrame while returning a new DataFrame with the added columns. 
#It does not modify the original DataFrame in place.
#Usage: It is commonly used to create derived columns or add calculated values to a DataFrame without altering the 
#original data.

                   A         B         C         D    E     temp_f
2013-01-01 -0.899185  0.803563  1.984353  1.604849  1.0  30.381467
2013-01-02 -0.340097  1.556520 -0.209207  0.161533  1.0  31.387826
2013-01-03  0.936663 -0.113085  0.055640  0.494500  NaN  33.685993
2013-01-04  0.684376  1.719106  1.145440 -1.792193  NaN  33.231877

In [199]:
ex_df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
ex_df1_with_sum = ex_df1.assign(Sum=df['A'] + df['B'])

Values Counts

In [157]:
import pandas as pd
import numpy as np
s = pd.Series(np.random.randint(0, 7, size=10))

In [158]:
s

0    6
1    6
2    4
3    0
4    1
5    3
6    4
7    1
8    6
9    6
dtype: int32

In [159]:
s.unique()

array([6, 4, 0, 1, 3])

In [160]:
s.value_counts()

6    4
4    2
1    2
0    1
3    1
dtype: int64

Concat
pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations. https://pandas.pydata.org/docs/reference/api/pandas.concat.html

In [161]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.514009  0.085911  0.164823 -0.949330
1  0.965260 -1.217474 -0.006821  2.657463
2  1.173994 -2.151384  1.749894  0.983214
3  0.777169  0.895312  0.539548  0.988331
4  0.708755 -1.157598  0.431242  0.407009
5 -2.053483 -0.581808 -0.383299  2.262933
6  0.728378 -0.116496  1.061752  1.306590
7  0.107127 -0.774767  0.507065  2.259526
8  1.618711 -0.917702 -1.140107  0.549344
9 -0.953823 -0.213374 -0.237303 -1.675339

In [162]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.514009  0.085911  0.164823 -0.949330
 1  0.965260 -1.217474 -0.006821  2.657463
 2  1.173994 -2.151384  1.749894  0.983214,
           0         1         2         3
 3  0.777169  0.895312  0.539548  0.988331
 4  0.708755 -1.157598  0.431242  0.407009
 5 -2.053483 -0.581808 -0.383299  2.262933
 6  0.728378 -0.116496  1.061752  1.306590,
           0         1         2         3
 7  0.107127 -0.774767  0.507065  2.259526
 8  1.618711 -0.917702 -1.140107  0.549344
 9 -0.953823 -0.213374 -0.237303 -1.675339]

In [163]:
pd.concat(pieces)

          0         1         2         3
0 -1.514009  0.085911  0.164823 -0.949330
1  0.965260 -1.217474 -0.006821  2.657463
2  1.173994 -2.151384  1.749894  0.983214
3  0.777169  0.895312  0.539548  0.988331
4  0.708755 -1.157598  0.431242  0.407009
5 -2.053483 -0.581808 -0.383299  2.262933
6  0.728378 -0.116496  1.061752  1.306590
7  0.107127 -0.774767  0.507065  2.259526
8  1.618711 -0.917702 -1.140107  0.549344
9 -0.953823 -0.213374 -0.237303 -1.675339

In [164]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2], axis=0)

0    a
1    b
0    c
1    d
dtype: object

In [165]:
pd.concat([s1, s2], axis=1)

   0  1
0  a  c
1  b  d

Join

In [166]:
left = pd.DataFrame({"key1": ["apple", "mango"], "lval": [1, 2]})
left

    key1  lval
0  apple     1
1  mango     2

In [167]:
right = pd.DataFrame({"key2": ["apple", "mango"], "rval": [4, 5]})
right

    key2  rval
0  apple     4
1  mango     5

In [168]:
pd.merge(left, right, left_on="key1", right_on="key2", how='left')

    key1  lval   key2  rval
0  apple     1  apple     4
1  mango     2  mango     5

In [169]:
pd.merge?

https://pandas.pydata.org/docs/reference/api/pandas.merge.html

By â€œgroup byâ€ we are referring to a process involving one or more of the following steps:

Splitting the data into groups based on some criteria

Applying a function to each group independently

Combining the results into a data structure

In [170]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [171]:
df

     A      B         C         D
0  foo    one  2.169364  1.121223
1  bar    one  1.296347  0.391260
2  foo    two  0.064385 -0.975766
3  bar  three -1.570728 -0.971151
4  foo    two -1.015620 -1.727110
5  bar    two  0.365074  0.343813
6  foo    one  0.191878  0.833395
7  foo  three -0.586272 -0.183167

Grouping and then applying the sum() function to the resulting groups:

In [172]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  0.090693 -0.236078
foo  0.823736 -0.931425

In [173]:
df.groupby(["A", "B"])[["C", "D"]].agg(['sum', 'max', 'min'])

                  C                             D
                sum       max       min       sum       max       min
A   B
bar one    1.296347  1.296347  1.296347  0.391260  0.391260  0.391260
    three -1.570728 -1.570728 -1.570728 -0.971151 -0.971151 -0.971151
    two    0.365074  0.365074  0.365074  0.343813  0.343813  0.343813
foo one    2.361242  2.169364  0.191878  1.954618  1.121223  0.833395
    three -0.586272 -0.586272 -0.586272 -0.183167 -0.183167 -0.183167
    two   -0.951235  0.064385 -1.015620 -2.702876 -0.975766 -1.727110

In [174]:
import numpy as np
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["a", "b", "c"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  a  foo  2.386753 -1.200417
1     one  b  foo -1.745976  1.634017
2     two  c  foo  1.065733  1.273836
3   three  a  bar  0.597107 -1.042744
4     one  b  bar -1.171011 -0.116452
5     one  c  bar -0.378238 -0.434539
6     two  a  foo  0.514360  0.132048
7   three  b  foo  0.908312 -0.621806
8     one  c  foo  0.590053  0.764737
9     one  a  bar -0.826308  0.651237
10    two  b  bar  0.025809 -1.501201
11  three  c  bar -0.895379 -0.920467

In [175]:
pd.pivot_table(df, values= ["D"], index=["A", "B"], columns=["C"])

                D
C             bar       foo
A     B
one   a -0.826308  2.386753
      b -1.171011 -1.745976
      c -0.378238  0.590053
three a  0.597107       NaN
      b       NaN  0.908312
      c -0.895379       NaN
two   a       NaN  0.514360
      b  0.025809       NaN
      c       NaN  1.065733

In [176]:
data = ['peter', 'Paul', None, 'MARY', 'gUIDO']
names = pd.Series(data)
names

0    peter
1     Paul
2     None
3     MARY
4    gUIDO
dtype: object

In [177]:
names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

In [178]:
import pandas as pd
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Abraham',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [179]:
monte

0    Graham Chapman
1       John Cleese
2     Terry Abraham
3         Eric Idle
4       Terry Jones
5     Michael Palin
dtype: object

In [180]:
monte.str.lower()

0    graham chapman
1       john cleese
2     terry abraham
3         eric idle
4       terry jones
5     michael palin
dtype: object

In [181]:
monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [182]:
monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [183]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Abraham]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

Methods similar to Python string methods
Nearly all Python's built-in string methods are mirrored by a Pandas vectorized string method. Here is a list of Pandas str methods that mirror Python string methods:

len()	lower()	translate()	islower()
ljust()	upper()	startswith()	isupper()
rjust()	find()	endswith()	isnumeric()
center()	rfind()	isalnum()	isdecimal()
zfill()	index()	isalpha()	split()
strip()	rindex()	isdigit()	rsplit()
rstrip()	capitalize()	isspace()	partition()
lstrip()	swapcase()	istitle()	rpartition()

Methods using regular expressions
In addition, there are several methods that accept regular expressions to examine the content of each string element, and follow some of the API conventions of Python's built-in re module:

Method	Description
match()	Call re.match() on each element, returning a boolean.
extract()	Call re.match() on each element, returning matched groups as strings.
findall()	Call re.findall() on each element
replace()	Replace occurrences of pattern with some other string
contains()	Call re.search() on each element, returning a boolean
count()	Count occurrences of pattern
split()	Equivalent to str.split(), but accepts regexps
rsplit()	Equivalent to str.rsplit(), but accepts regexps

In [184]:
monte.str[0:3]

0    Gra
1    Joh
2    Ter
3    Eri
4    Ter
5    Mic
dtype: object

In [185]:
monte.str.split().str.get(-1)

0    Chapman
1     Cleese
2    Abraham
3       Idle
4      Jones
5      Palin
dtype: object

In [186]:
import pandas as pd
import numpy as np


df= pd.DataFrame({'number': np.random.randint(1, 100, 10)})
# df
df['bins'] = pd.cut(x=df['number'], bins=[1, 20, 40, 60, 80, 100])
print(df)

   number           bins
0      83  (80.0, 100.0]
1       9    (1.0, 20.0]
2       9    (1.0, 20.0]
3      69   (60.0, 80.0]
4      97  (80.0, 100.0]
5      73   (60.0, 80.0]
6      81  (80.0, 100.0]
7      40   (20.0, 40.0]
8       1            NaN
9      44   (40.0, 60.0]

In [187]:
df = pd.DataFrame(np.array([1, 7, 5, 4, 6, 3]), columns=['A'])
df['bins'] = pd.cut(df['A'], bins = 3, labels=["bad", "medium", "good"])
df

   A    bins
0  1     bad
1  7    good
2  5  medium
3  4  medium
4  6    good
5  3     bad

In [188]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                  'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [189]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [190]:
pd.melt?

In [191]:
import pandas as pd

In [192]:
df = pd.DataFrame(
    {
    'A':[1,2,3,4],
    'B': [4,3,2,1]
})

In [193]:
df.empty

False

In [194]:
df

   A  B
0  1  4
1  2  3
2  3  2
3  4  1

In [195]:
df['C'] = df['A']*df['B']
df
df.drop('c' , axis = 1 , inplace = True)
df

KeyError: "['c'] not found in axis"

In [ ]:
df.iloc[3,2]

In [ ]:
for  ind, value in df.iterrows():
    print(ind,value)

In [ ]:
df1 = pd.DataFrame(
    {
    'A':[1,2,3,4],
    'B': [4,3,2,1]
})

In [ ]:
df1

In [ ]:
df1.rename(columns = { 'B':'F', 'E':'A'}, inplace = True)
df1

In [ ]:
df4 = pd.concat([df,df1])

In [ ]:
df4.fillna(0)

In [ ]:
#df4 = df4.reset_index()
df4
#df4.drop(['level_0','index'], axis = 1, inplace = True)

In [ ]:
#df4.drop(['level_0','index'], axis = 0, inplace = True)
df4.columns

In [ ]:
df4

In [ ]:
# df4['F'] = df4['F']*2
# df4
df4['F'].map(apply(lambda x: x *2))